app/views/cart/show.html.erb

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]
---
            </thead>
            <% for order_product in @cart.order_products %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <td><%= order_product.product.name %></td>
            <td><%= order_product.product.size %></td>