app/admin/orders.rb

      row :order_date
      row :amount
      row :product_name do |obj|
        obj.order_products.map{|it| it.product.name }
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 2]]