app/controllers/cart_controller.rb

  def add
      @cart.save if @cart.new_record?
      session[:cart_id] = @cart.id
      product = Product.find(params[:id])
      OrderProduct.create! :order => @cart, :product => product, :price => product.price
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2019-10-17 16:21:11.429799"], ["updated_at", "2019-10-17 16:21:11.429799"], ["user_id", 1]]
INSERT INTO "order_products" ("price", "created_at", "updated_at", "order_id", "product_id") VALUES (?, ?, ?, ?, ?)  [["price", 1002.0], ["created_at", "2019-10-17 16:21:11.699332"], ["updated_at", "2019-10-17 16:21:11.699332"], ["order_id", 1], ["product_id", 1]]

  def find_cart
      @cart = session[:cart_id] ? Order.find(session[:cart_id]) : current_user.orders.build
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]