app/models/order.rb

    def checkout!
      self.order_date = Time.now
      self.save
---
UPDATE "orders" SET "order_date" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_date", "2019-10-17 16:25:59.386293"], ["updated_at", "2019-10-17 16:25:59.390907"], ["id", 1]]